mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xl/s6e2c5xl.svd
        <!-- REGISTER "HEOF" -->
        <register>
          <name>HEOF</name>
          <description>EOF Setup Register [BHW]</description>
          <addressOffset>0x2114</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HEOF" -->
            <field>
              <name>HEOF</name>
              <description>End Frame</description>
              <msb>13</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HFRAME" -->
        <register>
          <name>HFRAME</name>
          <description>Frame Setup Register [BHW]</description>
          <addressOffset>0x2118</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x07FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRAME" -->
            <field>
              <name>FRAME</name>
              <description>Frame Setup</description>
              <msb>10</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HTOKEN" -->
        <register>
          <name>HTOKEN</name>
          <description>Host Token Endpoint Register [BHW]</description>
          <addressOffset>0x211C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TGGL" -->
            <field>
              <name>TGGL</name>
              <description>toggle bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TKNEN" -->
            <field>
              <name>TKNEN</name>
              <description>token enable bits</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ENDPT" -->
            <field>
              <name>ENDPT</name>
              <description>endpoint bits</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UDCC" -->
        <register>
          <name>UDCC</name>
          <description>UDC Control Register [BHW]</description>
          <addressOffset>0x2120</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00A0</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RST" -->
            <field>
              <name>RST</name>
              <description>Function Reset bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RESUM" -->
            <field>
              <name>RESUM</name>
              <description>Resume Setting bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HCONX" -->
            <field>
              <name>HCONX</name>
              <description>Host Connection bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USTP" -->
            <field>
              <name>USTP</name>
              <description>USB Operating Clock Stop bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STALCLREN" -->
            <field>
              <name>STALCLREN</name>
              <description>Endpoint 1 to 5 STAL bit Clear Select bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFBK" -->
            <field>
              <name>RFBK</name>
              <description>Data Toggle Mode Select bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PWC" -->
            <field>
              <name>PWC</name>
              <description>Power Control bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP0C" -->
        <register>
          <name>EP0C</name>
          <description>EP0 Control Register [HW]</description>
          <addressOffset>0x2124</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0040</resetValue>
          <resetMask>0x0FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STAL" -->
            <field>
              <name>STAL</name>
              <description>Endpoint 0 Stall Setting bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PKS" -->
            <field>
              <name>PKS</name>
              <description>Packet Size Endpoint 0 Setting bits</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP1C" -->
        <register>
          <name>EP1C</name>
          <description>EP1 Control Register [HW]</description>
          <addressOffset>0x2128</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x6100</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EPEN" -->
            <field>
              <name>EPEN</name>
              <description>Endpoint Enable bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TYPE" -->
            <field>
              <name>TYPE</name>
              <description>Endpoint Transfer Type Select bits</description>
              <msb>14</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIR" -->
            <field>
              <name>DIR</name>
              <description>Endpoint Transfer Direction Select bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMAE" -->
            <field>
              <name>DMAE</name>
              <description>DMA Automatic Transfer Enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NULE" -->
            <field>
              <name>NULE</name>
              <description>Null Automatic Transfer Enable bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STAL" -->
            <field>
              <name>STAL</name>
              <description>Endpoint Stall Setting bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PKS" -->
            <field>
              <name>PKS</name>
              <description>Packet Size Setting bits</description>
              <msb>8</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
