mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xl/s6e2c5xl.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SDIF" -->
    <peripheral>
      <name>SDIF</name>
      <description>SD Card Interface</description>
      <version>A</version>
      <groupName>SDIF</groupName>
      <baseAddress>0x4006E000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x55</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x58</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xFC</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x118</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x154</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "SD" -->
      <interrupt>
        <name>SD</name>
        <value>118</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "SSA2" -->
        <register>
          <name>SSA2</name>
          <description>SDMA System Address / Argument 2 Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "SBSIZE" -->
        <register>
          <name>SBSIZE</name>
          <description>Block Size Register [BHW]</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HSDMABUFBD" -->
            <field>
              <name>HSDMABUFBD</name>
              <description>Host SDMA Buffer Boundary</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRSFBLCKSZ" -->
            <field>
              <name>TRSFBLCKSZ</name>
              <description>Transfer Block Size</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SBLCNT" -->
        <register>
          <name>SBLCNT</name>
          <description>Block Count Register [BHW]</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "SSA1" -->
        <register>
          <name>SSA1</name>
          <description>Argument 1 Register [BHW]</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "STRSFMD" -->
        <register>
          <name>STRSFMD</name>
          <description>Transfer Mode Register [BHW]</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0037</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BLCKCNTSEL" -->
            <field>
              <name>BLCKCNTSEL</name>
              <description>Multi / Single Block select</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTRSFDIR" -->
            <field>
              <name>DTTRSFDIR</name>
              <description>Data Transfer Direction Select</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AUTOCMDEN" -->
            <field>
              <name>AUTOCMDEN</name>
              <description>Auto Command Enable</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLCKCNTEN" -->
            <field>
              <name>BLCKCNTEN</name>
              <description>Block Count Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMAEN" -->
            <field>
              <name>DMAEN</name>
              <description>DMA Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCMMD" -->
        <register>
          <name>SCMMD</name>
          <description>Command Register [BHW]</description>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3FFB</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMDINDEX" -->
            <field>
              <name>CMDINDEX</name>
              <description>Command Index</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDTYPE" -->
            <field>
              <name>CMDTYPE</name>
              <description>Command Type</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATPRESSEL" -->
            <field>
              <name>DATPRESSEL</name>
              <description>Data Present Select</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDIDXCHKE" -->
            <field>
              <name>CMDIDXCHKE</name>
              <description>Command Index Check Enable</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDCRCCHKE" -->
            <field>
              <name>CMDCRCCHKE</name>
              <description>Command CRC Check Enable</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RESPTYPE" -->
            <field>
              <name>RESPTYPE</name>
              <description>Response Type Select</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SRESP0" -->
        <register>
          <name>SRESP0</name>
          <description>Response Register 0 [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "SRESP1" -->
        <register>
          <name>SRESP1</name>
          <description>Response Register 1 [BHW]</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "SRESP2" -->
        <register>
          <name>SRESP2</name>
          <description>Response Register 2 [BHW]</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
